package com.example.fw.common.codepoints.catalog;

import org.terasoluna.gfw.common.codepoints.CodePoints;

/**
 *  JIS X 0213の追加非漢字の特殊文字、特殊カタカナ（1面6区）の文字集合を表すクラス
 */
public final class JIS_X_0213_6ku_AddedSpecialCharsKatakana extends CodePoints {
    private static final long serialVersionUID = 1L;

    /**
     * コンストラクタ
     */
    public JIS_X_0213_6ku_AddedSpecialCharsKatakana() {
        super(
            0x2664, // ♤(01-06-25) 
            0x2660, // ♠(01-06-26) 
            0x2662, // ♢(01-06-27) 
            0x2666, // ♦(01-06-28) 
            0x2661, // ♡(01-06-29) 
            0x2665, // ♥(01-06-30) 
            0x2667, // ♧(01-06-31) 
            0x2663, // ♣(01-06-32) 
            0x03c2, // ς(01-06-57) 
            0x24f5, // ⓵(01-06-58) 
            0x24f6, // ⓶(01-06-59) 
            0x24f7, // ⓷(01-06-60) 
            0x24f8, // ⓸(01-06-61) 
            0x24f9, // ⓹(01-06-62) 
            0x24fa, // ⓺(01-06-63) 
            0x24fb, // ⓻(01-06-64) 
            0x24fc, // ⓼(01-06-65) 
            0x24fd, // ⓽(01-06-66) 
            0x24fe, // ⓾(01-06-67) 
            0x2616, // ☖(01-06-68) 
            0x2617, // ☗(01-06-69) 
            0x3020, // 〠(01-06-70) 
            0x260e, // ☎(01-06-71) 
            0x2600, // ☀(01-06-72) 
            0x2601, // ☁(01-06-73) 
            0x2602, // ☂(01-06-74) 
            0x2603, // ☃(01-06-75) 
            0x2668, // ♨(01-06-76) 
            0x25b1, // ▱(01-06-77) 
            0x31f0, // ㇰ(01-06-78) 
            0x31f1, // ㇱ(01-06-79) 
            0x31f2, // ㇲ(01-06-80) 
            0x31f3, // ㇳ(01-06-81) 
            0x31f4, // ㇴ(01-06-82) 
            0x31f5, // ㇵ(01-06-83) 
            0x31f6, // ㇶ(01-06-84) 
            0x31f7, // ㇷ(01-06-85) 
            0x31f8, // ㇸ(01-06-86) 
            0x31f9, // ㇹ(01-06-87) 
            0x31F7, // ㇷ゚(01-06-88) 合成文字
            0x309A, // ㇷ゚(01-06-88) 合成文字
            0x31fa, // ㇺ(01-06-89) 
            0x31fb, // ㇻ(01-06-90) 
            0x31fc, // ㇼ(01-06-91) 
            0x31fd, // ㇽ(01-06-92) 
            0x31fe, // ㇾ(01-06-93) 
            0x31ff // ㇿ(01-06-94)    
        );
    }
}